In [1]:
import pandas as pd

a=[1, 2, 3,4]
s1=pd.Series(a)
s1.index=['a','b','c','d']
print(s1)
print(type(s1))
print(s1.shape)
print(s1.index)

a    1
b    2
c    3
d    4
dtype: int64
<class 'pandas.core.series.Series'>
(4,)
Index(['a', 'b', 'c', 'd'], dtype='object')

In [2]:
a={'a':10,'b':20, 'c':30}
s2=pd.Series(a)
s2

a    10
b    20
c    30
dtype: int64

In [3]:
names=['kim','lee','park','hong','jang']
scores=[85,70,75,90,95]
majors=['컴공','정보통신','경영','컴공','경영']

data={'name':names,'score':scores,'major':majors}
df=pd.DataFrame(data)
df

   name  score major
0   kim     85    컴공
1   lee     70  정보통신
2  park     75    경영
3  hong     90    컴공
4  jang     95    경영

In [106]:
names=['kim','lee','park','hong','jang']
scores=[85,70,75,90,95]
majors=['컴공','정보통신','경영','컴공','경영']

data={'name':names,'score':scores,'major':majors}
df1=pd.DataFrame([names, scores, majors])
df1

     0     1     2     3     4
0  kim   lee  park  hong  jang
1   85    70    75    90    95
2   컴공  정보통신    경영    컴공    경영

In [4]:
data1=[names, majors, scores]
df=pd.DataFrame(data1).T
df.columns=['name','major','score']
df['grade']=[1,3,2,1,4]
df['level']=["B","C","C","A","A"]
df

   name major score  grade level
0   kim    컴공    85      1     B
1   lee  정보통신    70      3     C
2  park    경영    75      2     C
3  hong    컴공    90      1     A
4  jang    경영    95      4     A

In [5]:
#del df['grade']
df.index=['a','b','c','d','e']
df[['score','major','name']]

  score major  name
a    85    컴공   kim
b    70  정보통신   lee
c    75    경영  park
d    90    컴공  hong
e    95    경영  jang

In [6]:
#print(df.iloc[1:3])
print(df.loc['a':'d',['name','major']])
df

   name major
a   kim    컴공
b   lee  정보통신
c  park    경영
d  hong    컴공

   name major score  grade level
a   kim    컴공    85      1     B
b   lee  정보통신    70      3     C
c  park    경영    75      2     C
d  hong    컴공    90      1     A
e  jang    경영    95      4     A

In [7]:
df.loc[df.major=='컴공',['name','major']]

   name major
a   kim    컴공
d  hong    컴공

In [8]:
names=['kim','lee','park','hong','jang']
kor=[80,85,98,90,75]
eng=[85,90,100,95,75]
math=[80,75,90,85,80]

# total=kor+eng+math
# avg=tatal/3

In [9]:
df=pd.DataFrame({'name':names,'kor':kor,'eng':eng,'math':math})
df['total']=df.kor+df.eng+df.math
df['avg']=df.total/3
df

   name  kor  eng  math  total        avg
0   kim   80   85    80    245  81.666667
1   lee   85   90    75    250  83.333333
2  park   98  100    90    288  96.000000
3  hong   90   95    85    270  90.000000
4  jang   75   75    80    230  76.666667

이름이 lee인 사람의 국어 점수를 검색하라. 평균이 90점 이상인 사람의 이름과 평균을 검색하라.인덱스를 사용하여
1행~3행까지 이름, total, avg를 검색하라.

In [15]:
df.loc[df.name=='lee',['name','kor']]
df.loc[df.avg>=90,['name','avg']]
df.iloc[:3,[0,4,5]]
df['합격여부']=['합격' if a>=90 else '불합격' for a in df['avg']]
df

   name  kor  eng  math  total        avg 합격여부
0   kim   80   85    80    245  81.666667  불합격
1   lee   85   90    75    250  83.333333  불합격
2  park   98  100    90    288  96.000000   합격
3  hong   90   95    85    270  90.000000   합격
4  jang   75   75    80    230  76.666667  불합격

In [16]:
df.index=['a','b','c','d','e']
df

   name  kor  eng  math  total        avg 합격여부
a   kim   80   85    80    245  81.666667  불합격
b   lee   85   90    75    250  83.333333  불합격
c  park   98  100    90    288  96.000000   합격
d  hong   90   95    85    270  90.000000   합격
e  jang   75   75    80    230  76.666667  불합격

In [17]:
df.describe()

             kor         eng       math       total        avg
count   5.000000    5.000000   5.000000    5.000000   5.000000
mean   85.600000   89.000000  82.000000  256.600000  85.533333
std     8.905055    9.617692   5.700877   22.645088   7.548363
min    75.000000   75.000000  75.000000  230.000000  76.666667
25%    80.000000   85.000000  80.000000  245.000000  81.666667
50%    85.000000   90.000000  80.000000  250.000000  83.333333
75%    90.000000   95.000000  85.000000  270.000000  90.000000
max    98.000000  100.000000  90.000000  288.000000  96.000000

In [18]:
df.sum(axis=0)

name     kimleeparkhongjang
kor                     428
eng                     445
math                    410
total                  1283
avg              427.666667
합격여부          불합격불합격합격합격불합격
dtype: object

In [39]:
#python open()함수
#scv 모듈
#pandas 모듈

infilepath="data/input.csv"
outfilepath="data/output1.csv"

In [41]:
#python open
with open(infilepath,'r', newline='') as reader:
    with open(outfilepath,'w',newline="") as writer:
        header=reader.readline()
        header=header.strip()
        header_list=header.split(',')
        print(header_list)
        #print(type(header_list))
        
        writer.write(','.join(header_list)+"\n")
        for row in reader:
            row=row.strip()
            row_list=row.split(',')
            print(row_list)
            writer.write(','.join(row_list)+"\n")

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']
['A', '001-1001', '2341', '"$500', '000"', '2014-01-20']
['A', '001-1001', '5467', '500000', '2014-01-20']
['A', '001-1001', '5407', '750000', '2014-01-20']
['A', '001-1001', '2341', '750000', '2014-01-20']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9505', '6650', '125000', '2017-02-03']
['B', '50-9505', '6650', '125000', '2017-02-03']
['C', '920-4803', '3321', '615000', '2017-02-03']
['C', '920-4804', '3321', '615000', '2017-02-10']
['C', '920-4805', '3321', '615000', '2017-02-17']
['C', '920-4806', '3321', '615000', '2017-02-24']

In [43]:
#python open, Supplier name이 A이고 Cost가 700000이상인 데이터 선택
with open(infilepath,'r', newline='') as reader:
    with open(outfilepath,'w',newline="") as writer:
        header=reader.readline()
        header=header.strip()
        header_list=header.split(',')
        print(header_list)
        #print(type(header_list))
        
        writer.write(','.join(header_list)+"\n")
        for row in reader:
            row=row.strip().replace("$","").replace('"','')
            row_list=row.split(',')
            
            if len(row_list)==6:
                row_list[3]=float(row_list[3]+row_list[4])
                row_list[4]=row_list[5]
                del row_list[5]
            else:
                row_list[3]=float(row_list[3])
                
            if(row_list[0]=='A') & (row_list[3]>=700000):
                 print(row_list)
                 writer.write(','.join(map(str,row_list))+"\n")

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']
['A', '001-1001', '5407', 750000.0, '2014-01-20']
['A', '001-1001', '2341', 750000.0, '2014-01-20']

In [44]:
df=pd.read_csv(outfilepath)
print(df)
df.to_csv("data/output2.csv", index=False)

  Supplier Name Invoice Number  Part Number      Cost Purchase Date
0             A       001-1001         5407  750000.0    2014-01-20
1             A       001-1001         2341  750000.0    2014-01-20

In [45]:
df=pd.read_csv(infilepath)
#print(df)
df['Cost'] =df['Cost'].str.strip('$').str.replace(",","").astype(float)
result=df.loc[(df['Supplier Name']=='C') | (df['Cost']<250000),:]
#print(result)
result.to_csv("data/output3.csv", index=False)

In [46]:
df= pd.read_csv(infilepath)
#print(df)
df['Cost'] = df['Cost'].str.strip('$').str.replace(",","").astype(float)
df2=df[['Supplier Name', 'Cost']]
result=df2.groupby('Supplier Name').mean()
print(result)

                   Cost
Supplier Name
A              625000.0
B              187500.0
C              615000.0

In [47]:
#python open, 조건 검색 행만 선택하기
#supplier name이 A이고 cost가 700000이상인 데이터 선택
with open(infilepath,'r',newline='') as reader:
    with open(outfilepath,'w',newline="") as writer:
        header=reader.readline()
        header=header.strip()
        header_list=header.split(',')
        print(header_list)
        
        writer.write(','.join(header_list)+"\n")

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']

In [57]:
#python open, 조건 검색 행만 선택하기
#supplier name이 A이고 cost가 700000이상인 데이터 선택
with open(infilepath,'r',newline='') as reader:
    with open(outfilepath,'w',newline="") as writer:
        header=reader.readline()
        header=header.strip()
        header_list=header.split(',')
        print(header_list)
        
        writer.write(','.join(header_list)+"\n")
        
        for row in reader:
            row=row.strip().replace("$","").replace('"','')
            row_list=row.split(',')
            
            if(row_list[0]=='A') & (row_list[3] >='700000'):
                
                print (row_list)
                writer.write(','.join(map(str,row_list))+"\n")

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']
['A', '001-1001', '5407', '750000', '2014-01-20']
['A', '001-1001', '2341', '750000', '2014-01-20']

In [59]:
#Supplier Name이 C이거나 Cost가 250,000 미만인 것을 선택하라.
with open(infilepath,'r',newline='') as reader:
    with open(outfilepath,'w',newline="") as writer:
        header=reader.readline()
        header=header.strip()
        header_list=header.split(',')
        print(header_list)
        
        writer.write(','.join(header_list)+"\n")
        
        for row in reader:
            row=row.strip().replace("$","").replace('"','')
            row_list=row.split(',')
            
            if(row_list[0]=='C') | (row_list[3] < '250000'):
                
                print (row_list)
                writer.write(','.join(map(str,row_list))+"\n")

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']
['B', '50-9505', '6650', '125000', '2017-02-03']
['B', '50-9505', '6650', '125000', '2017-02-03']
['C', '920-4803', '3321', '615000', '2017-02-03']
['C', '920-4804', '3321', '615000', '2017-02-10']
['C', '920-4805', '3321', '615000', '2017-02-17']
['C', '920-4806', '3321', '615000', '2017-02-24']

In [69]:
kk=['red','blue','green']
str1=','.join(kk)
print(str1)

red,blue,green

In [107]:
ll=str1.split(',')
print(ll)

['red', 'blue', 'green']

In [71]:
#리스트 컴프리헨션
a=[]
for i in range(0,10,1):
    a.append(i)
print(a)

b=[i for i in range(10)]
print(b)

c=[i for i in range(10) if i%2==1]
print(c)

d=[i if i%2==0 else 0 for i in range(10)]
print(d)

e=[[i*j for j in range(5)] for i in range(10,15)]
print(e)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[1, 3, 5, 7, 9]
[0, 0, 2, 0, 4, 0, 6, 0, 8, 0]
[[0, 10, 20, 30, 40], [0, 11, 22, 33, 44], [0, 12, 24, 36, 48], [0, 13, 26, 39, 52], [0, 14, 28, 42, 56]]

In [72]:
import sqlite3

In [73]:
def create_table():
    conn=sqlite3.connect('my_book.db')
    cursor=conn.cursor()
    sql="""create table if not exists books(title text,
    publisher text, pages integer, recommend integer)"""
    cursor.execute(sql)
    conn.commit()
    conn.close()

In [83]:
create_table()

In [84]:
def insert_books(book):
    conn=sqlite3.connect('my_book.db')
    cursor=conn.cursor()
    #sql="insert into books values ('빅데이터 수집 및 저장','한국출판사',500,1)"
    sql="insert into books values(?,?,?,?)"
    
    cursor.execute(sql, book)
    conn.commit()
    conn.close

In [85]:
book=('빅데이터 수집 및 저장','한국출판',650,1)
insert_books(book)

In [86]:
def insert_many_books(books):
    conn=sqlite3.connect('my_book.db')
    cursor=conn.cursor()
    #sql="insert into books values('java','길벗',500, 1)"
    sql="insert into books values(?,?,?,?)"
    
    cursor.executemany(sql, books)
    conn.commit()
    conn.close()

In [87]:
books=[('빅데이터 분석','영진',600, 2),
       ('안드로이드','이지스퍼블리싱', 500,3),
       ('스프링','생능',650, 1)]
insert_many_books(books)

In [88]:
def all_books():
    conn=sqlite3.connect('my_book.db')
    cursor=conn.cursor()
    sql="select * from books"
    cursor.execute(sql)
    books=cursor.fetchall()
    print(books)
    print(len(books))
    
    for book in books:
        print(book)
    conn.close()

In [89]:
all_books()

[('빅데이터 수집 및 저장', '한국출판', 650, 1), ('빅데이터 분석', '영진', 600, 2), ('안드로이드', '이지스퍼블리싱', 500, 3), ('스프링', '생능', 650, 1)]
4
('빅데이터 수집 및 저장', '한국출판', 650, 1)
('빅데이터 분석', '영진', 600, 2)
('안드로이드', '이지스퍼블리싱', 500, 3)
('스프링', '생능', 650, 1)

In [90]:
def delete_book():
    conn=sqlite3.connect('my_book.db')
    cursor=conn.cursor()
    #sql="insert into books values('java','길벗', 500,1)"
    sql="delete from books where title=?"
    
    cursor.execute(sql,('스프링',))
    conn.commit()
    conn.close()

In [91]:
delete_book()

In [98]:
import cx_Oracle
def all_product():
    conn=cx_Oracle.connect("c##madang/c##madang@localhost:1521/xe")
    cursor=conn.cursor()
    sql="select * from book";
    cursor.execute(sql)
    for row in cursor:
        description=row[1]
        print(description)
        #data=list(row)
        #data[0]=description
        #print(data)
    conn.close()

In [99]:
all_product()

축구의 역사
축구아는 여자
축구의 이해
골프 바이블
피겨 교본
역도 단계별기술
야구의 추억
야구를 부탁해
Olympic Champions
스포츠 세계

In [100]:
def insert_product(data):
    conn=cx_Oracle.connect("c##madang/c##madang@localhost:1521/xe")
    cursor=conn.cursor()
    sql="insert into book values(:1,:2,:3,:4)";
    
    cursor.execute(sql, data)
    conn.commit()
    conn.close()

In [101]:
data=(13, '빅데이터 교재','서면출판사',12300)
insert_product(data)

In [104]:
def insert_many_product(data):
    conn=cx_Oracle.connect("c##madang/c##madang@localhost:1521/xe")
    cursor=conn.cursor()
    sql="insert into book values(:1,:2,:3,:4)";
    
    cursor.executemany(sql, data)
    conn.commit()
    conn.close()

In [105]:
items=[(14, '오렌지의 이해','국대출판사', 12000),
       (15, '키위에 대한 고찰','미국출판사', 13000),
       (16, '포도 요리법','한류출판사', 54000),
       (17, '딸기가 좋아','미래출판사', 7800),
       (18, '귤도 좋다','IT출판사', 32000)]
insert_many_product(items)

In [110]:
def name_select():
    conn=cx_Oracle.connect("c##madang/c##madang@localhost:1521/xe")
    cursor=conn.cursor()
    sql="select * from book where bookname=:1";
    cursor.execute(sql, ('포도 요리법',))
    for row in cursor:
        publisher = row[2]
        data=list(row)
        data[1]=publisher
        print(data)
    conn.close()

In [111]:
name_select()

[16, '한류출판사', '한류출판사', 54000]

In [122]:
def delete_product():
    conn=cx_Oracle.connect("c##madang/c##madang@localhost:1521/xe")
    cursor=conn.cursor()
    sql="delete from product where product_id=:1";
    
    cursor.execute(sql, (1,))
    conn.commit()
    conn.close()

In [123]:
delete_product()
all_product()

IntegrityError: ORA-02292: 무결성 제약조건(C##MADANG.SYS_C008450)이 위배되었습니다- 자식 레코드가 발견되었습니다

In [124]:
import pymysql

In [138]:
def select_all():
    conn=pymysql.connect(host='localhost', user='oeh',
                         password='1234', db='jspdb', charset='utf8')
    cursor=conn.cursor()
    sql='select * from board'
    cursor.execute(sql)
    for book in cursor:
        print(book)
    conn.close()

In [139]:
select_all()

OperationalError: (1045, "Access denied for user 'oeh'@'localhost' (using password: YES)")